docs/sequence-diagrams/data-ingestion-monitoring-controller.puml
@startuml

title Monitoring Import Controller Flow

participant "Import Controller" as IMPORTCONTROLLER
participant "FTP Client" as FTPCLIENT
participant "S3 Client"  as S3CLIENT
participant "Record Service" as RECORDSERVICE

IMPORTCONTROLLER -> FTPCLIENT: download(importId, timeBox)
FTPCLIENT ->> S3CLIENT: processZipFileFromS3(importId)
S3CLIENT ->> RECORDSERVICE: importHasMoreToDownload(importId)
RECORDSERVICE ->> IMPORTCONTROLLER: result
IMPORTCONTROLLER ->> RECORDSERVICE: importHasMoreToProcess(importId)
RECORDSERVICE ->> IMPORTCONTROLLER: result
IMPORTCONTROLLER ->> RECORDSERVICE: importSchedules()
RECORDSERVICE ->> IMPORTCONTROLLER: import schedules

@enduml
